In [47]:
import pandas as pd

In [66]:
df_1880 = pd.read_csv('names\yob1880.txt', names=['Name', 'Gender','Count'])
df_1880['Year'] = 1880
df_1880.sort_values('Count').tail(3)

        Name Gender  Count  Year
0       Mary      F   7065  1880
943  William      M   9532  1880
942     John      M   9655  1880

In [49]:
df_1900 = pd.read_csv('names\yob1900.txt', names=['Name', 'Gender','Count'])
df_1950 = pd.read_csv('names\yob1950.txt', names=['Name', 'Gender','Count'])
df_2000 = pd.read_csv('names\yob2000.txt', names=['Name', 'Gender','Count'])

In [43]:
df_res = pd.concat([df_1900, df_1950, df_2000])
df_res

           Name Gender  Count
0          Mary      F  16706
1         Helen      F   6343
2          Anna      F   6114
3      Margaret      F   5304
4          Ruth      F   4765
...         ...    ...    ...
29767      Zeph      M      5
29768     Zeven      M      5
29769     Ziggy      M      5
29770        Zo      M      5
29771     Zyier      M      5

[43805 rows x 3 columns]

In [50]:
df_res.reset_index()

       index      Name Gender  Count
0          0      Mary      F  16706
1          1     Helen      F   6343
2          2      Anna      F   6114
3          3  Margaret      F   5304
4          4      Ruth      F   4765
...      ...       ...    ...    ...
43800  29767      Zeph      M      5
43801  29768     Zeven      M      5
43802  29769     Ziggy      M      5
43803  29770        Zo      M      5
43804  29771     Zyier      M      5

[43805 rows x 4 columns]

In [65]:
df_res.groupby('Name').sum().sort_values('Count').tail(3)

         Count
Name
Robert  101368
John    109601
James   111789